DmitriyKunitsin/STM32/ManchesterNew17.07/Firmware/Source/Library/Tools/Utils/RebootUtils.c
// RebootUtils.c
// Утилиты, связанные с запуском и перезагрузкой
// Переработка с целью стабилизации процесса загрузки
#include "ProjectConfig.h"		// конфиг платформы, конфиг задачи.
#include "stm32xxxx_hal.h"		// дрова периферии
#include "RebootUtils.h"		// родной
#include "SKLP_Service.h"		// SKLP_Time
#include <stdio.h>				// snprintf()
#include "common_rcc.h"			// SystemClock_Config( )
#include "common_gpio.h"		// SystemClock_Config( )
#include "platform_common.h"	// DEVSIGN_UID
#include "FreeRTOS.h"			// xTaskGetTickCount()
#include "Timers.h"				// TimerHandle_t
#include "Logger.h"

// Определить, что делать в случае срабатывании assert() или Hard Fault - зависать или перезагружаться
#ifndef	ASSERTION_HALT					// зависнуть при срабатывании assert()
	#define	ASSERTION_RESET				// перезагрузиться при срабатывании assert()
#else
	#warning "!!! В результате Assert/Hard Fault происходит останов! УБРАТЬ ИЗ РЕЛИЗА!!!"
#endif	// ASSERTION_HALT

#ifdef	ASSERTON_WRITE2UART				// при срабатывании assert() отправить сообщение в последовательный канал
	#warning "!!! В результате Assert/Hard Fault будет передана посылка в SKL.UART! УБРАТЬ ИЗ РЕЛИЗА!!!"
#endif	// ASSERTON_WRITE2UART

#ifndef	APPLICATIONS
	#warning "Выполнить инициализацию APPLICATIONS в проекте!"
	#define	APPLICATIONS	{ FLASH_APPLICATION_BASE_BOOT, APPLICATION_BASE, FLASH_APPLICATION_BASE_FTPSERVER }
#endif	// APPLICATIONS

// ПорЯдок загрузки приложениЯ
// 1. Перехват SystemInitCallback() - вызываетсЯ из Reset->SystemInit(),
// либо __low_level_init() - вызываетсЯ из Reset->__iar_program_start().
// - Переход на другое приложение, если требуетсЯ;
// - ИнициализациЯ WDT;
// - ИнициализациЯ осциллЯтора и тактированиЯ шин;
// - ИнициализациЯ HAL;
// - ИнициализациЯ HAL_IncTick();
// - ИнициализациЯ DWT_Timer;
// 2. Работа основной программы, вызов SystemHardwareInit() длЯ идентификации причины сброса.
// 
// 3. Обеспечить вызов SysTick->HAL_IncTick() на частоте 1000 Гц как до запуска RTOS, так и после.

// ИнформациЯ, сохранЯемаЯ в RAM при программной перезагрузке.
// ОбъЯвлена __no_init, чтобы не потерЯть информацию при инициализации статических переменных.
// Размещена в самом конце основной RAM, чтобы в эту область случайно не залез загрузчик.
volatile __no_init ResetInfo_t ResetInfo @ ( SRAM_MAIN_END + 1 - sizeof( ResetInfo_t ) );		// Информация по перезагрузкам. !!Не размещать логгируемый текст в CCM, т.к. эта строка напрямую записывается в файл, а запись по DMA не работает с CCM

// ****************************
// IWDG, Сторожевой таймер
// ****************************
static __no_init IWDG_HandleTypeDef IwdgHandle;			// Хендлер сторожевого таймера 

// ИнициализациЯ сторожевого таймера на интервал 2..4 с
static void WatchdogInit( void )
{
	#ifndef	IWDG_DISABLE
	IwdgHandle.Instance			= IWDG;
	IwdgHandle.Init.Prescaler	= IWDG_PRESCALER_16;		// (32..64) eAo / 32 -> 1..2 eAo
	IwdgHandle.Init.Reload		= 0xFFF;					// 1..2 eAo / 4096 -> 0,25..0,5 Ao (2..4 n)
#ifdef	STM32L4
	// Ae? STM32L4xx i?aaoniio?ai ieiiiue ?a?ei. Anee na?in IWDG i?iecaiaeon? i?e ( Counter > Window ), oi i?ienoiaeo iaiaaeaiiue Reset.
	IwdgHandle.Init.Window		= IwdgHandle.Init.Reload;	// oaeei ia?acii, ieiiiue ?a?ei aoaao ioe??ai
#endif	// STM32L4
	// IWDG (Independed watchdog) Init
	assert_param( HAL_OK == HAL_IWDG_Init( &IwdgHandle ) );

#else
	#warning	"!!!IWDG ioee??ai! Oa?aou ec ?aeeca! OA?AOU EC ?AEECA!!!"
#endif	// IWDG_DISABLE
}

// Перезапуск сторожевого таймера
void WatchdogReset( void )
{
	#ifndef	IWDG_DISABLE
	assert_param( HAL_OK == HAL_IWDG_Refresh( &IwdgHandle ) );		// Reset IWDG
#endif	// IWDG_DISABLE
}

// **********************************************
// Переход на приложение, слинкованное на указанный адрес
// **********************************************
static __noreturn void JumpToApplication( uint32_t ApplicationAddress )
{
	// Проверка, что адрес стека указывает на RAM
    assert_param( ( ( *( __IO uint32_t * ) ApplicationAddress ) & 0x2FFE0000 ) == 0x20000000 );
	// Инициализировать указатель стека
	__set_MSP( *( __IO uint32_t * ) ApplicationAddress );
	SCB->VTOR = ApplicationAddress;
	// Адрес перехода - вектор Reset
	FunctionVoid_t pApplicationReset = ( FunctionVoid_t ) *( ( __IO uint32_t * ) ( ApplicationAddress + 4 ) );
	pApplicationReset( );
	while( 1 );
}

// Коллбек из SystemInit(), перед передачей управлениЯ на инициализацию IAR.
// Немедленный переход на другое приложение, если требуетсЯ.
// ИнициализациЯ WDT, HSE, PLL, SYSCLK, SysTick.
// !!! Статические переменные еще не инициализированы, и будут инициализированы позже!
void SystemInitCallback( void )
{
	ResetInfo.ResetStage = ResetStage_SystemInitStart;
	// Проверка соответствиЯ программы целевому чипу
	// *********************************************
	// Проверить, что реальный чип соответствует целевому чипу проекта
	assert_param( DEVSIGN_DEVID == DBGMCU_IDCODE_DEVID );	// проверка чипа
#ifdef	TARGET_PACKAGE
	assert_param( TARGET_PACKAGE == DEVSIGN_PACKAGE );		// проверка корпуса
#endif	//TARGET_PACKAGE

	// Опциональный переход на другое приложение
	// *****************************************
	if( __HAL_RCC_GET_FLAG( RCC_FLAG_SFTRST ) )
	{	// Выполнен программный сброс.
		// Возможно, цель была сбросить периферию перед переходом на приложение/функцию
		if( ResetInfoTag_JumpToApp == ResetInfo.Tag )
		{	// Сброс был произведен с целью сбросить периферию и перейти на определенное приложение
			// Проверить, есть ли запрошенное приложение в числе объЯвленных
			const uint32_t aApplications[] = APPLICATIONS;
			for( int i = 0; i < SIZEOFARRAY( aApplications ); i++ )
				if( aApplications[i] == ResetInfo.xResetToApplication )
				{
#ifdef	FLASH_APPLICATION_BASE_BOOT
					if( FLASH_APPLICATION_BASE_BOOT == ResetInfo.xResetToApplication )
					{ 	// При переходе на загрузчик, сбросить все флаги перезагрузок.
						// ДлЯ загрузчика это ЯвлЯетсЯ признаком прЯмого перехода из основной микропрограммы,
						// что должно приводить к переводу загрузчика в режим идентификации на времЯ порЯдка единиц секунд.
						__HAL_RCC_CLEAR_RESET_FLAGS( );
					}
#endif	// FLASH_APPLICATION_BASE_BOOT
					ResetInfo.Tag = ResetInfoTag_Reboot;
					JumpToApplication( ResetInfo.xResetToApplication );
				}
			assert_param( 0 );
		}
		else if( ResetInfoTag_JumpToFunc == ResetInfo.Tag )
		{	// Сброс был произведен с целью сбросить периферию и перейти на определенную функцию
			ResetInfo.TagSaved = ResetInfo.Tag;
			ResetInfo.Tag = ResetInfoTag_Reboot;
			ResetInfo.ResetCounter++;
			( ( FunctionVoid_t ) ResetInfo.xResetToApplication ) ( );
		}
	}

	// ИнициализациЯ WDT
	// *******************************
	// Основное тактирование чипа еще не проинициализировано, но у IWDG свой независимый таймер.
	// После инициализации тактированиЯ, переинициализировать таймер не требуетсЯ.
	// ИнициализациЯ IWDG производитсЯ раньше инициализации тактированиЯ,
	// т.к. проблемы при запуске осциллЯторов могут вызвать зависание.
	WatchdogInit( );
	// IWDG запущен, и может теперь быть остановлен только в результате сброса MCU.
	
	// ************************
	// ПерваЯ инициализациЯ HAL driver
	// ************************
	// Далее будет произведен вызов HAL_Init()->HAL_InitTick(),
	// причем HAL_InitTick() использует статические переменные SystemCoreClock и uwTickFreq,
	// которые на данный момент еще не инициализированы по-умолчанию.
	SystemCoreClockUpdate( );					// инициализировать SystemCoreClock
#if		defined( STM32L4 )
	extern uint32_t uwTickFreq;
	uwTickFreq = HAL_TICK_FREQ_DEFAULT;			// инициализировать uwTickFreq на 1 кГц
#elif	defined( STM32F4 )
	extern HAL_TickFreqTypeDef uwTickFreq;
	uwTickFreq = HAL_TICK_FREQ_DEFAULT;			// инициализировать uwTickFreq на 1 кГц
#else
#error "Select Target Family!"
#endif
	assert_param( HAL_OK == HAL_Init( ) );
	// После перехода в main(), SystemCoreClock и uwTickFreq будут инициализированы по-умолчанию,
	// по-этому потребуетсЯ повторить процедуру!

	// ИнициализациЯ осциллЯтора и тактированиЯ шин
	// ********************************************
	// ИнициализациЯ HSE, PLL, SYSCLK, HCLK, PCLK, SysTick.
	// При вызове HAL_RCC_OscConfig() и HAL_RCC_ClockConfig() возможно зависание,
	// если не функционирует HAL_IncTick(). Расчет на то, что при таких проблемах спасет WDT.
	SystemClock_Config( );
	// В результате тактирование инициализировано,
	// RTC, если был запущен до сброса от HSE, продолжил работу на правильной частоте,
	// SystemCoreClock инициализирован,
	// SysTick запущен на 1000 Гц.
	// !!! Важно !!!
	// SystemCoreClock содержит частоту SYSCLK и ЯвлЯетсЯ глобальной переменной.
	// По-умолчанию обЯвлена, в расчете работы от HSI после сброса:
	// - System_stm32F4xx.c		uint32_t SystemCoreClock = 16000000;
	// - System_stm32L4xx.c		uint32_t SystemCoreClock = 4000000;
	// Здесь, при вызове HAL_RCC_ClockConfig(), переменнаЯ обновлЯетсЯ до реального значениЯ.
	// Но после перехода на main(), происходит инициализациЯ значением по-умолчанию.
	// Возможно объЯвить как __no_init, но не факт, что это объЯвление правильно расползетсЯ по проектам.
	// ДлЯ надежности требуетсЯ вызывать SystemCoreClockUpdate() после перехода на main().

	// ИнициализациЯ DWT_Timer
	// Ранее не имело смысла, т.к. тактирование еще производилось от HSI без PLL.
	DWT_TimerEnable( );
	// ?? Почему именно разрешение, а не инициализациЯ?
	// ?? Если DWT был задействован в BootLoader, он там порЯдком насчитает,
	// ?? затем при вызове SystemInit() замедлитсЯ, но все равно к этому времени накопит произвольный счет.
	DWT_AppendTimestampTag( "RCC Init" );

	// Напоследок, сбросить WDT
	WatchdogReset( );
	ResetInfo.ResetStage = ResetStage_SystemInitFinish;
}

// **********************************************
// Когда-то здесь была инициализациЯ тактированиЯ и WDT,
// а также немедленный переход на требуемое приложение,
// но теперь этовсе перемещено в SystemInitCallback().
// Осталась обработка причины сброса.
// **********************************************
void SystemHardwareInit( void )
{
	ResetInfo.ResetStage = ResetStage_SystemHardwareInitStart;
	// ВтораЯ инициализациЯ HAL driver
	// ************************
	// Далее будет произведен вызов HAL_Init()->HAL_InitTick(),
	// причем HAL_InitTick() использует статические переменные SystemCoreClock и uwTickFreq,
	// которые на данный момент переинициализированы по-умолчанию.
	// Обновить SystemCoreClock
	SystemCoreClockUpdate( );
	// Инициализировать HAL driver
	assert_param( HAL_OK == HAL_Init( ) );

