DmitriyKunitsin/STM32/ManchesterNew17.07/Firmware/Source/Library/Tools/Utils/RebootUtils.c
	// Анализ ResetInfo.Tag - поле, устанавливаемое перед программным сбросом
	switch( ResetInfo.Tag )
	{
	case ResetInfoTag_JumpToApp:	// перезагрузка с целью сбросить периферию и перейти на определенное приложение
	case ResetInfoTag_JumpToFunc:	// перезагрузка с целью сбросить периферию и перейти на определенную функцию
		// Эти признаки должны были быть обработаны еще в SystemInitCallback()
		assert_param( 0 );
		break;
		
	case ResetInfoTag_Assertion:	// перезагрузка в результате Assertion
	case ResetInfoTag_HardFault:	// перезагрузка в результате Hard Fault
	case ResetInfoTag_Reboot:		// перезагрузка в результате решениЯ приложениЯ
		ResetInfo.TagSaved = ResetInfo.Tag;
		ResetInfo.Tag = ResetInfoTag_Clear;
		ResetInfo.ResetCounter++;
		break;
		
	default:						// скорее всего, аппаратнаЯ перезагрузка
		ResetInfo.aRebootMessage[0] = '\0';
//		ResetInfo.TagSaved = ResetInfoTag_Hardware;
//		ResetInfo.Tag = ResetInfoTag_Clear;
		ResetInfo.ResetCounter = 0;
		ResetInfo.RTC_SubsecondCorrection = 0;
	}

	// Определение источников, вызвавших ресет - включение, WDT, программная перезагрузка
	char *apResetSources[] =
	// Обработать флаги, в которых накапливаются источники перезагрузок.
	// Флаги сбрасываютсЯ по команде __HAL_RCC_CLEAR_RESET_FLAGS()
	{
		( __HAL_RCC_GET_FLAG( RCC_FLAG_PINRST )		? "Pin"						: NULL ),
		( __HAL_RCC_GET_FLAG( RCC_FLAG_SFTRST )		? "Software"				: NULL ),
		( __HAL_RCC_GET_FLAG( RCC_FLAG_IWDGRST )	? "Independent Watchdog"	: NULL ),
		( __HAL_RCC_GET_FLAG( RCC_FLAG_WWDGRST )	? "Window Watchdog"			: NULL ),
		( __HAL_RCC_GET_FLAG( RCC_FLAG_LPWRRST )	? "Low Power"				: NULL ),
#if		defined( STM32F4 )
		( __HAL_RCC_GET_FLAG( RCC_FLAG_BORRST )		? "POR/PDR or BOR"			: NULL ),
		( __HAL_RCC_GET_FLAG( RCC_FLAG_PORRST )		? "POR/PDR"					: NULL ),
#elif	defined( STM32L4 )
		( __HAL_RCC_GET_FLAG( RCC_FLAG_BORRST )		? "POR/PDR or BOR"			: NULL ),
		( __HAL_RCC_GET_FLAG( RCC_FLAG_FWRST )		? "Firewall"				: NULL ),
		( __HAL_RCC_GET_FLAG( RCC_FLAG_OBLRST )		? "Option Byte Loader"		: NULL ),
#elif	defined( STM32F3 )
		( __HAL_RCC_GET_FLAG( RCC_FLAG_PORRST )		? "POR/PDR"					: NULL ),
		( __HAL_RCC_GET_FLAG( RCC_FLAG_OBLRST )		? "Option Byte Loader"		: NULL ),
#else
#error "Select Target Family!"
#endif
	};

	// Попытка перейти от набора флагов к истинной причине перезагрузки
	ResetInfo.ResetSource = ResetSource_Undefined;
	if( __HAL_RCC_GET_FLAG( RCC_FLAG_LPWRRST )
#if		defined( STM32F4 )
		|| __HAL_RCC_GET_FLAG( RCC_FLAG_BORRST ) || __HAL_RCC_GET_FLAG( RCC_FLAG_PORRST )
#elif	defined( STM32L4 )
		|| __HAL_RCC_GET_FLAG( RCC_FLAG_BORRST )
#elif	defined( STM32F3 )
		|| __HAL_RCC_GET_FLAG( RCC_FLAG_PORRST )
#endif
		)
		ResetInfo.ResetSource = ResetSource_Power;
	else if( __HAL_RCC_GET_FLAG( RCC_FLAG_IWDGRST ) || __HAL_RCC_GET_FLAG( RCC_FLAG_WWDGRST ) )
		ResetInfo.ResetSource = ResetSource_Watchdog;
	else if( __HAL_RCC_GET_FLAG( RCC_FLAG_SFTRST ) )
	{
		switch( ResetInfo.TagSaved )
		{
		case ResetInfoTag_Assertion:	ResetInfo.ResetSource = ResetSource_SoftAssertion;	break;
		case ResetInfoTag_HardFault:	ResetInfo.ResetSource = ResetSource_SoftFault;		break;
		case ResetInfoTag_Reboot:		ResetInfo.ResetSource = ResetSource_SoftReboot;		break;
		default:						ResetInfo.ResetSource = ResetSource_SoftUndefined;	break;
		}
	}
	else if( __HAL_RCC_GET_FLAG( RCC_FLAG_PINRST ) )
		ResetInfo.ResetSource = ResetSource_Pin;		// при софтовом ресете почему-то выставляется еще и Pin :-/
	__HAL_RCC_CLEAR_RESET_FLAGS( ); 	// сбросить все флаги перезагрузок

	// Формирование текстовой строки с перечислением источников сброса
	char aResetSourceText[25*4];		// строка, куда будут записаны все источники перезагрузок с момента последнего сброса флагов
	int TextLenght = 0;
	for( int i = 0; i < SIZEOFARRAY( apResetSources ); i++ )
		if( NULL != apResetSources[i] )
			TextLenght += snprintf( aResetSourceText + TextLenght, sizeof( aResetSourceText ) - TextLenght, " %s;", apResetSources[i] );

	// Получить идентификационный номер чипа
	uint32_t const * const pU_ID = DEVSIGN_UID_BASE;
	
	// Сформировать текстовый блок, который может быть сохранен на SD после запуска нормальной работы
	TextLenght = snprintf( ( char * ) ResetInfo.aLogMessage, sizeof( ResetInfo.aLogMessage ),
		"\r\n[RESET]\r\nSource(s):%s\r\nNote: %s\r\nReset Counter: %d\r\nProgram %s rev.%s for %s build at %s %s on %s\r\n",
		aResetSourceText, ResetInfo.aRebootMessage, ResetInfo.ResetCounter,
		aBuildInfo_ProjName, aBuildInfo_SVN_Revision, aBuildInfo_ConfigName, aBuildInfo_Date, aBuildInfo_Time, aBuildInfo_ComputerName );
	ResetInfo.aRebootMessage[0] = '\0';
	if( ResetSource_Power == ResetInfo.ResetSource )
		TextLenght += snprintf( TextLenght + ( char * ) ResetInfo.aLogMessage, sizeof( ResetInfo.aLogMessage ) - TextLenght,
			"Chip ID: %08lX %08lX %08lX\r\n", pU_ID[2], pU_ID[1], pU_ID[0] );

/*	// ИнициализациЯ SysTick на 1000 Гц уже произведена в SystemInitCallback()->SystemClock_Config()
	// и в SystemInitCallback()->HAL_Init().
	// Схема группировки вызовов прерываний установлена при вызове SystemInitCallback()->HAL_Init().
	// На всЯкий случай, продублировать установку схемы группировки прерываний длЯ RTOS:
	HAL_NVIC_SetPriorityGrouping( NVIC_PRIORITYGROUP_RTOS );
	// До запуска планировщика RTOS, Systick продолжает работать в режиме,
	// установленном при вызове SystemInitCallback().
	// При запуске планировщика RTOS, производитсЯ повторнаЯ инициализациЯ SysTick портом RTOS.
	// ПодразумеваетсЯ, что SysTick при этом будет запущен в том же режиме, на 1000 Гц.
*/

	WatchdogReset( );
	ResetInfo.ResetStage = ResetStage_SystemHardwareInitFinish;
	ResetInfo.ResetStage = ResetStage_InitComplete;
}


// ***************************************************************************
// ***************************************************************************
// Различные варианты перезагрузок
// ***************************************************************************
// ***************************************************************************

#ifdef	ASSERTON_WRITE2UART
// Скинуть сообщение о перезагрузке в UART
// !! Использовать в крайних случаЯх, когда нет возможности отладитьсЯ иначе!
#include "Common_UART.h"
static void WriteRebootMessage2UART( void )
{
	UART_Ext_HandleTypeDef *pUartExtHdl = &COM_SKLP_485_UART_EXT_HDL;
	HAL_UART_DMAStop( &pUartExtHdl->Common );
	HAL_GPIO_WritePin( pUartExtHdl->TXEN_GPIO, pUartExtHdl->TXEN_Pin, GPIO_PIN_SET );
//	GPIO_Common_Write( pUartExtHdl->iGPIO_TxEn, GPIO_PIN_SET );
	HAL_UART_Transmit( &pUartExtHdl->Common, ( uint8_t * ) ResetInfo.aRebootMessage, strlen( ( char * ) ResetInfo.aRebootMessage ), 100 );
	HAL_GPIO_WritePin( pUartExtHdl->TXEN_GPIO, pUartExtHdl->TXEN_Pin, GPIO_PIN_RESET );
//	GPIO_Common_Write( pUartExtHdl->iGPIO_TxEn, GPIO_PIN_RESET );
}
#endif	// ASSERTON_WRITE2UART

// ****************************************
// Выполнить принудительную перезагрузку
// ****************************************
static ASSERT_ATTRIBUTE /*__noreturn*/ void RebootUtils_Reset( void )
{
	// Запретить все прерываниЯ
	__disable_irq( );
	ResetInfo.ResetStage = ResetStage_SoftReset;
	
#ifdef	ASSERTON_WRITE2UART
	#warning "!!! УБРАТЬ ИЗ РЕЛИЗА !!!"
	// Только длЯ assert(), в целЯх отладки, допускаетсЯ скидывать сообщение о перезагрузке в UART.
	// !! Использовать в крайних случаЯх, когда нет возможности отладитьсЯ иначе!
	if( ResetInfoTag_Assertion == ResetInfo.Tag )
		WriteRebootMessage2UART( );
#endif	// ASSERTON_WRITE2UART

	// Вызвать проектно-зависимый _последний_ коллбек
	FaultCallback( );

#ifdef	ASSERTION_HALT	
	#warning "!!! УБРАТЬ ИЗ РЕЛИЗА !!!"
	// Только длЯ assert(), в целЯх отладки, допускаетсЯ останов.
	// !! Использовать в релизных версиЯх рисковано!
	if( ResetInfoTag_Assertion == ResetInfo.Tag )
	{	// Останов обеспечиваетсЯ бесконечным циклом с постоЯнным сбросом IWDG
		while( 1 )
			WatchdogReset( );
	}
#endif	// ASSERTION_HALT	

	// Выполнить программную перезагрузку
	NVIC_SystemReset( );
}

// Получить текущее времЯ в виде текстовой строки
// Не используетсЯ защищенный доступ, т.к. здесь все вызовы выполнЯютсЯ с запретом прерываний
static char const *GetLocalTimeStr( void )
{
	return Time_SKLP2String( ( SKLP_Time6_t * ) &SKLP_Time.Time6 );
}

// ****************************************
// Перезагрузка с пояснением.
// Текст будет сохранен в ResetInfo, и опционально будет скинут в лог (если есть) после перезагрузки.
// ****************************************
__noreturn void Reboot( const char *pNote )
{
	// Запретить все прерываниЯ
	__disable_irq( );
	// Сохранить информацию о программной перезагрузке в неповреждаемую область ОЗУ
	ResetInfo.Tag = ResetInfoTag_Reboot;
	if( NULL == pNote )
		pNote = "Unknown";
	snprintf( ( char * ) ResetInfo.aRebootMessage, sizeof( ResetInfo.aRebootMessage ),
			"[%08X] %s Software reboot: %s", xTaskGetTickCount( ), GetLocalTimeStr( ), pNote );
	// Выполнить программную перезагрузку
	RebootUtils_Reset( );
#ifdef	ASSERT_USE_CALL_STACK
	while( 1 );
#endif
}

// **********************************************
// Запросить перезагрузку через заданный таймаут
// **********************************************
static const char *pDelayedRebootNote = NULL;
static __noreturn void TimerRebootCallbackFunction( TimerHandle_t pTimer )
{
	Reboot( pDelayedRebootNote );
}

bool RebootDelayed( const float Delay_s, const char *pNote )
{
	static TimerHandle_t RebootTimerHandle = NULL;
	bool Result = false;
	do
	{
		if( RebootTimerHandle != NULL )
			break;
		if( pDelayedRebootNote != NULL )
			break;
		RebootTimerHandle = xTimerCreate( "RebootTmr", ( TickType_t ) ( Delay_s * configTICK_RATE_HZ ), pdTRUE, NULL, TimerRebootCallbackFunction );
		if( NULL == RebootTimerHandle )
			break;
		if( pdPASS != xTimerStart( RebootTimerHandle, 0 ) )
			break;
		Result = true;
		pDelayedRebootNote = pNote;

		char aMsg[80];
		snprintf( aMsg, sizeof( aMsg ), "Delayed for %f s reboot query: %s", Delay_s, pNote );
		assert_param( Logger_WriteRecord( aMsg, LOGGER_FLAGS_APPENDTIMESTAMP ) );
	} while( 0 );
	return Result;
}


// **********************************************
// Перезагрузка с переходом на выбранное приложение.
// Оставляет сообщение о планируемом переходе в лог.
// Оставляет информацию о новой точке входа в ResetInfo и выполняет перезагрузку (чтобы сбросить всю перефирию)
// **********************************************
__noreturn void ResetToApplication( uint32_t xApplication )
{
	// Не запрещать прерываниЯ до завершениЯ формированиЯ сообщениЯ в лог!
	// Сохранить информацию о программной перезагрузке в неповреждаемую область ОЗУ
	snprintf( ( char * ) ResetInfo.aRebootMessage, sizeof( ResetInfo.aRebootMessage ),
			"Reset to Application at 0x%08lX", xApplication );
	// Скинуть сообщение в лог на SD (если есть) и дождатьсЯ завершениЯ записи
	assert_param( Logger_WriteRecord( ( char * ) ResetInfo.aRebootMessage, LOGGER_FLAGS_WAITEFORCOMPLETE | LOGGER_FLAGS_APPENDTIMESTAMP ) );
	// Продолжить сохранение информации о программной перезагрузке в неповреждаемую область ОЗУ
	ResetInfo.Tag = ResetInfoTag_JumpToApp;
	ResetInfo.xResetToApplication = xApplication;
	// Выполнить программную перезагрузку
	RebootUtils_Reset( );
#ifdef	ASSERT_USE_CALL_STACK
	while( 1 );
#endif
}

// **********************************************
// Перезагрузка с последующим переходом на выбранную функцию
// **********************************************
__noreturn void ResetToFunction( FunctionVoid_t xFunction )
{
	// Сохранить информацию о программной перезагрузке в неповреждаемую область ОЗУ
	ResetInfo.Tag = ResetInfoTag_JumpToFunc;
	ResetInfo.xResetToApplication = ( uint32_t ) xFunction;
	// Выполнить программную перезагрузку
	RebootUtils_Reset( );
#ifdef	ASSERT_USE_CALL_STACK
	while( 1 );
#endif
}

// **********************************************
// Обработчик assert()
// !!! Убран модификатор __noreturn, чтобы при попадании в assert() при отладке,
// !!! в стеке вызовов сохранЯлсЯ источник assert()
// **********************************************
/*#ifdef	USE_FULL_ASSERT
ASSERT_ATTRIBUTE void assert_failed( const char *pFile, uint32_t Line, const char *pFunc )
{
	// Запретить все прерываниЯ
	__disable_irq( );
	// Сохранить информацию о программной перезагрузке в неповреждаемую область ОЗУ
	ResetInfo.Tag = ResetInfoTag_Assertion;
	snprintf( ( char * ) ResetInfo.aRebootMessage, sizeof( ResetInfo.aRebootMessage ),
			"[%08X] %s Assertion failed: %s at %lu (%s).", xTaskGetTickCount( ), GetLocalTimeStr( ), pFile, Line, pFunc );
	// Выполнить программную перезагрузку
	RebootUtils_Reset( );
}
#endif	// USE_FULL_ASSERT*/

// **********************************************
// Обработчик Hard Fault
// **********************************************
static const char *pHardFaultReason = NULL;
ASSERT_ATTRIBUTE /*__noreturn*/ void hard_fault_handler_c (unsigned int * hardfault_args)
{
	typedef struct FaultState_struct
	{
		uint32_t	R0;
		uint32_t	R1;
		uint32_t	R2;
		uint32_t	R3;
		uint32_t	R12;
		uint32_t	*LR;
		uint32_t	*PC;
		uint32_t	PSR;
	} FaultState_t;

