DmitriyKunitsin/STM32/ManchesterNew17.07/Firmware/Source/Library/Tools/Utils/RebootUtils.c
	volatile FaultState_t *pFaultState = ( FaultState_t * ) hardfault_args;
	volatile SCB_Type *pSCB = SCB;

	( void ) pFaultState;
	( void ) pSCB;

	// Сохранить информацию о программной перезагрузке в неповреждаемую область ОЗУ
	ResetInfo.Tag = ResetInfoTag_HardFault;
	snprintf( ( char * ) ResetInfo.aRebootMessage, sizeof( ResetInfo.aRebootMessage ),
//		"[%08X] %s Hard Fault!", xTaskGetTickCount( ), GetLocalTimeStr( ) );
		"[%08X] %s %s Fault! LR=%08X PC=%08X", xTaskGetTickCount( ), GetLocalTimeStr( ), pHardFaultReason, pFaultState->LR, pFaultState->PC );
	// Выполнить программную перезагрузку
	RebootUtils_Reset( );
}

ASSERT_ATTRIBUTE /*__noreturn*/ void HardFault_CommonHandler(void)
{
	asm volatile
	(
		"TST LR, #4			\n"
		"ITE EQ				\n"
		"MRSEQ R0, MSP		\n"
		"MRSNE R0, PSP		\n"
		"B hard_fault_handler_c  "
	);

	// ОбъЯснить компилЯтору, что возврат из функции не требуетсЯ
	while( 1 );
}

ASSERT_ATTRIBUTE /*__noreturn*/ void HardFault_Handler( void )
{
	pHardFaultReason = "Hard";
	HardFault_CommonHandler( );
}

ASSERT_ATTRIBUTE /*__noreturn*/ void MemManage_Handler( void )
{
	pHardFaultReason = "MemManage";
	HardFault_CommonHandler( );
}

ASSERT_ATTRIBUTE /*__noreturn*/ void BusFault_Handler( void )
{
	pHardFaultReason = "Bus";
	HardFault_CommonHandler( );
}

ASSERT_ATTRIBUTE /*__noreturn*/ void UsageFault_Handler( void )
{
	pHardFaultReason = "Usage";
	HardFault_CommonHandler( );
}

ASSERT_ATTRIBUTE /*__noreturn*/ void FLASH_IRQHandler( void )
{
	pHardFaultReason = "FLASH";
	HardFault_CommonHandler( );
}

// Коллбек из обработчика assert() и Hard Fault - можно произвести необходимые действия (дернуть пинами) в случае отказа
__weak void FaultCallback( void )
{
	// Реализовать необходимые действия в проектно-зависимой части
}


